str1='最新Canvas通知: '
b=bytes(str1, encoding='utf-8')
print(b)

str1='我是GG爆, V我50'
b=bytes(str1, encoding='utf-8')
print(b)

str1=' 按照《上海交通大学本科生管理规定》第三十八条第（二）项的规定，你应于本学期开学两周内 vivo 50。截止到目前，学校未收到你的 50 。按照《上海交通大学本科生管理规定》第三十八条第（五）项、第四十四条第（二）项规定，应予退学，学校现向你发出退学处理预通知书。\r\n请在收到本通知书后2周内办理好退学和离校手续。如你对本退学处理预通知书有异议，可以自收到本通知书之日起5日内，向学院提出陈述、申辩，逾期视为你放弃权利。如没有异议，或者陈述、申辩的理由不成立，请你在规定时间内办理好退学和离校手续。逾期学校将按照《上海交通大学本科生管理规定》对你作出退学处理决定。\r\n特此告知。'
b=bytes(str1, encoding='utf-8')
print(b)

str1='  退学通知'
b=bytes(str1, encoding='utf-8')
print(b)